Bwooce/iridium_acars/p4-usb-host/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_360=y

# Build with -O2. Default IDF target picks "Debug" (-Og) which is awful for
# scalar DSP loops — the windowing, magnitude, and EMA loops measured 4×
# slower under -Og than the same code at -O2. Cost: a slightly larger
# binary (still well within the 1 MB app partition) and slightly worse
# stepping behaviour in gdb. Worth it.
# (IDF v6.1 only exposes Debug/Size/Performance/None as choices; no LTO
# option in Kconfig. Per-file aggressive flags are applied via the main
# CMakeLists.txt for the DSP hot files.)
CONFIG_COMPILER_OPTIMIZATION_PERF=y
# CONFIG_COMPILER_OPTIMIZATION_DEBUG is not set
CONFIG_SPIRAM=y
CONFIG_SPIRAM_TYPE_OCTAL=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MEMTEST=y
# DMA-capable internal SRAM reserve. Bumped from 32 KB (IDF default)
# so driver-side internal allocations don't spill into PSRAM (which
# would add load on the AXI bus that DSP and worker share).
#
# History:
#  - 98304 (96 KB) covered ingest_core1's raw + conv slot demand
#    (2 × 16 KB raw + 2 × 32 KB conv = 96 KB).
#  - 118784 (116 KB) added headroom for fft_sc16_2048's twiddle +
#    dsp_processor's s_accum + uw_correlator scratch.
#  - 180224 (176 KB) needed once esp_libusb's 4 × 8 KB = 32 KB async
#    bulk-IN transfer pool is also DMA-capable internal allocated
#    (CONFIG_USB_HOST_DWC_DMA_CAP_MEMORY_IN_PSRAM=n per the errata
#    hardening means usb_host_transfer_alloc cannot land buffers in
#    PSRAM). Without this bump, transfer_alloc returns
#    ESP_ERR_NO_MEM at start-stream because internal DMA heap is
#    exhausted by the wideband front-end's static allocations.
#
# ingest_core1's resample output (s_resamp) stays in PSRAM — AXI-
# GDMA reads PSRAM sources fine and the resample's CPU touch is one
# linear write per cycle.
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=147456
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
# Enables EXT_RAM_BSS_ATTR placement of static .bss variables into
# PSRAM. The .bss audit (docs/p4-bss-audit.md) identified ~140 KiB
# of firmware-owned static buffers (uw_correlator FFT scratch +
# precomputed tables, bch_decoder syndrome LUT) that are touched
# only on per-burst cadence and don't need DMA-internal SRAM. The
# annotations have no effect without this gate.
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
CONFIG_USB_HOST_HW_BUFFER_BIAS_IN=y
# Disabled to harden against ESP32-P4 v1.3 silicon errata MSPI-750 +
# APM-560 (memory/project_p4_errata_status.md). When ON, the option
# allows usb_host_transfer_alloc(..., USB_TRANSFER_FLAG_ALLOC_DMA, ...)
# callers to opt buffers INTO PSRAM. We never call with that flag
# today (all our calls use flag = 0 → internal SRAM), so disabling
# the capability is a no-op for current code. Disabling removes the
# trip-wire: a future hub-support / large-control-transfer change that
# sets ALLOC_DMA would otherwise silently land USB-DMA buffers in
# PSRAM, opening MSPI-750 (USB-DMA isn't 4-byte-aware) and APM-560
# (concurrent AHB master into PSRAM alongside our AXI-GDMA ring).
CONFIG_USB_HOST_DWC_DMA_CAP_MEMORY_IN_PSRAM=n

# Bigger L2 cache. Default was 128 KB; baseline[] (8 KB) + magnitudes[] (8 KB)
# + window_cplx (8 KB) + USB ringbuffer working-set don't co-exist cleanly in
# 128 KB and were thrashing during the baseline EMA.
#
# 512 KB ate 384 KB of internal SRAM heap and broke init (convert_buf malloc
# failed silently). 256 KB only takes 128 KB of internal SRAM and is still 2x
# the default — covers the DSP hot working set without starving heap.
CONFIG_CACHE_L2_CACHE_256KB=y

# FreeRTOS runtime stats so we can see %CPU per task per core. Required to
# answer "is Core 1 actually idle / where is Core 0 spending its time".
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_FREERTOS_USE_STATS_FORMATTING_FUNCTIONS=y
# xCoreID field in TaskStatus_t for the per-task dump.
CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID=y

# Watchdog tuning. The class_driver task on Core 0 is intentionally hot
# (drains the USB ringbuffer continuously); IDLE0 effectively never runs.
# Stop watching either IDLE task so legitimate full-load operation isn't a
# false-positive. Worker (Core 1) processes 200+ bursts/sec under flood and
# legitimately starves IDLE1; the previous "IDLE1 stays watched as a sanity
# check" tripped TWDT panics that the USB-CDC log doesn't capture (the
# panic dump goes to the dedicated UART pins). We don't use vTaskDelete,
# idle hook, or power policy — nothing relies on idle running.
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=n
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=n
# Backtrace + coredump on real WDT events instead of silent reset.
CONFIG_ESP_TASK_WDT_PANIC=y
# Bumped from the 5 s default to give the smoke task headroom while
# we work through Phase 3.6.M perf items (notably the rotate_to_dc
# cosf/sinf cost — task #58). The smoke task subscribes to the task
# WDT for Phase 2 and blocks inside ingest_core1_take_converted's
# xSemaphoreTake(portMAX_DELAY) when ingest+worker fall behind; at
# 5 s the smoke task panics before reaching its esp_task_wdt_reset()
# call. Revert to 5 once the rotation rewrite + ingest perf land.
CONFIG_ESP_TASK_WDT_TIMEOUT_S=60
# Per-task heap usage for diagnosing leaks under load. Left off for now —
# initial enable triggered an Interrupt WDT timeout on CPU1 during boot,
# probably from per-alloc critical sections piling up during the worker's
# big PSRAM allocations. Re-enable later if specifically debugging heap.
# CONFIG_HEAP_TASK_TRACKING=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ---------------------------------------------------------------
# D17: esp_hosted (Wi-Fi over SDIO RPC to the C6) — sized down so
# the always-on transport doesn't starve internal SRAM / DMA-INT
# below what the DSP pipeline needs. Without these, boot asserts in
# sdio_mempool_create or pumps perf through the floor.
#
# - MEMPOOL_PREFER_SPIRAM: route transport buffers to PSRAM (P4 GDMA
#   reaches PSRAM through cache, so this is free for our throughput).
# - DFLT_TASK_FROM_SPIRAM: hosted task stacks in PSRAM (saves ~10 KB
#   internal SRAM across the 3 hosted tasks).
# - SDIO Q sizes shrunk 20 → 8: queue arrays live in internal SRAM
#   even when mempool is PSRAM; 8 is plenty for our Wi-Fi traffic.
# - MAX_SIMULTANEOUS_*_RPC_REQUESTS 5 → 2: trim RPC queue depth.
# - MEM_MONITOR off / CLI off: unused features.
# - Stacks: trimmed slightly (still in PSRAM now).
# ---------------------------------------------------------------
CONFIG_ESP_HOSTED_MEMPOOL_PREFER_SPIRAM=y
CONFIG_ESP_HOSTED_DFLT_TASK_FROM_SPIRAM=y
CONFIG_ESP_HOSTED_SDIO_TX_Q_SIZE=8
CONFIG_ESP_HOSTED_SDIO_RX_Q_SIZE=8
CONFIG_ESP_HOSTED_RPC_TASK_STACK=3072
CONFIG_ESP_HOSTED_DFLT_TASK_STACK=2560
CONFIG_ESP_HOSTED_MAX_SIMULTANEOUS_SYNC_RPC_REQUESTS=2
CONFIG_ESP_HOSTED_MAX_SIMULTANEOUS_ASYNC_RPC_REQUESTS=2
CONFIG_ESP_HOSTED_MEM_MONITOR=n
CONFIG_ESP_HOSTED_CLI_ENABLED=n
